app/admin/dashboard_admin.rb

SELECT COUNT(*) FROM "users"
---
    def index
      @user_count = User.count()