app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "first_name", "last_name", "description", "status", "active", "private", "role", "slug", "user_uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def set_user
    @user = User.friendly.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]